
KeyList = {
 'Полное наименование юр. лица или ФИО ИП': "official_name",
 'УНП': "ref:vatin",
 'Место нахождения юр. лица/место жительства ИП': "addr:full",
 'Тип объекта': "type",
 'Наименование объекта/доменное имя интернет-магазина': "alt_name#2",
 'Наименование объекта/доменное имя интернет-магазина': "alt_name",
 'Название торговой сети (при наличии)': "name",
 'Место нахождения объекта: область': "addr:region",
 'Место нахождения объекта: район': "addr:district",
 'Место нахождения объекта: населенный пункт': "addr:city",
 'Место нахождения объекта: улица': "addr:street",
 'Место нахождения объекта: дом и корпус': "addr:housenumber",
 'Место нахождения объекта: квартира/офис': "addr:door",
 'Контакты объекта': "contact",
 'Вид торгового объекта в зависимости от формата': "format:view",
 'Вид объекта в зависимости от места расположения': "place:view",
 'Вид торгового объекта в зависимости от ассортимента товаров': "assortment:view",
 'Вид торгового объекта в зависимости от способа организации торговли "Фирменный"': "firm:is",
 'Тип торгового объекта (при наличии)': "amenity:type",
 'Торговая площадь торгового объекта (при наличии), кв. м': "trade:area",
 'Вид торговли "Розничная"': "retail:is",
 'Вид торговли "Оптовая"': "trade:is",
 'Форма розничной торговли без использования торгового объекта': "retail:place",
 'Оптовая торговля без использования торгового объекта': "place:is",
 'Классы реализуемых товаров': "category:class",
 'Группы реализуемых товаров': "category:group",
 'Подгруппы реализуемых товаров': "category:subgroup",
 'Тип объекта общественного питания в зависимости от формата (при наличии)': "cafe:type",
 'Количество мест в объекте общественного питания (при наличии), ед.': "amenity:cafe:capacity",
 'Количество общедоступных мест в объекте общественного питания (при наличии), ед.': "amenity:canteen:capacity",
 'Специализации торгового центра': "mall:specialization",
 'Количество торговых объектов, размещенных в торговом центре, ед.': "mall:capacity",
 'Количество объектов общественного питания, размещенных в торговом центре (при наличии), ед.': "foodcourt:capacity",
 'Площадь торгового центра, отведенная под торговые объекты, кв. м': " building:area",
 'Тип рынка': "marketplace:type",
 'Специализация рынка (при наличии)': "marketplace:specialization",
 'Количество торговых мест, размещенных на территории рынка, ед.': "marketplace:capacity",
 'Количество торговых объектов, размещенных на территории рынка, ед.': "marketplace:object:capacity",
 'Регистрационный номер в Торговом реестре': "ref:BY:trade_register",
 'Дата включения сведений в Торговый реестр': "start_date",
}


def ConvertDate(Text):
 Date = datetime.strptime(Text, "%d.%m.%Y").date()
 return Date.strftime("%Y-%m-%d") #%Y-%m-%dT%H:%M:%SZ


def NormalizeAddress(Address):
 Result = []
 for Index, Item in enumerate(Address):
  Item = Item.strip()
  if not(Index == 0 and Item.isdigit()):
   # выдаліць пачатковыя літары
   for Start in ["с/с", "аг.", "г.", "д.", "пр-т", "пр.", "Пр.", "Пл.", "тр-т", "б-р", "ул.", "ул ", "пер.", "Пер.", "переулок", "пр-д", "проспект", "улица", "Пр-т.", "Пр-т", "Им.", "гп ", "район", "Ст.", ]:
    if Item[:len(Start)] == Start:
     Item = Item[len(Start):]
   Item = Item.strip()
   # выдаліць канцавыя літары
   for End in ["обл.", "р-н.", "р-н", "А.А.", "с/с", "область", ]:
    if Item[-len(End):] == End:
     Item = Item[:-len(End)]
   Item = Item.strip()
   # выдаліць, калі пачынаецца з
   for Start in ["ком.", "оф.", "каб.", "пом.", "кв.", "район", "офис", "административное", "помещение", "Инв.", "кабинет", "этаж", "торговый объект", "нежилое помещение", "нежилое пом.", "Республика Беларусь", "РБ", ]:
    if Item[:len(Start)] == Start:
     Item = ""
   Item = Item.strip()
   # выдаліць, калі заканчваецца на
   for End in ["с-с.", "этаж", "помещение", "зданию", " под", " эт", ]:
    if Item[-len(End):] == End:
     Item = ""
   Item = Item.strip()
   # замяніць некаторыя супадзенні
   for Replace in ["р-н Центральный (г. Минск)", "р-н Ленинский (г. Минск)", "р-н Советский (г.Минск)", "р-н Московский (г. Минск)", "р-н Октябрьский (г. Минск)", "р-н Первомайский (г. Минск)", "р-н Партизанский (г. Минск)", "р-н Фрунзенский (г. Минск)", "р-н Заводской (г. Минск)", "р-н Ленинский (г. Могилев)", "р-н Октябрьский (г. Могилев)", "р-н Ленинский (г. Брест)", "р-н Московский (г. Брест)", "р-н Октябрьский (г. Витебск)",	"р-н Первомайский (г. Витебск)", "р-н Железнодорожный (г. Витебск)", "р-н Ленинский (г. Гродно)", "р-н Октябрьский (г. Гродно)", "р-н Центральный (г. Гомель)", "р-н Советский (г. Гомель)", "р-н Железнодорожный (г. Гомель)",  "р-н Новобелицкий (г. Гомель)", "р-н Ленинский (г. Бобруйск)", "р-н Первомайский (г. Бобруйск)", ]:
    Item = Item.replace(Replace, "")
   for Replace in ["техподполье", "&quot;", "Газ.", "АХЗ УП Ватра", "(открытая площадка)", "(аг.)", ]:
    Item = Item.replace(Replace, "")
   Item = Item.strip()
   # выдаліць пачатковыя літары яшчэ раз
   for Start in ["Б.", "В.", "Ф.", "П.", "К.", "Я.", "Э.", "Д.", "М.", "Л.", "О.", "Зм.", "С.", "А.", "Ю.", "Ак.", "И.", "Е.", "З.", ]:
    if Item[:len(Start)] == Start:
     Item = Item[len(Start):]
   #
   if Item:
    Result.append(Item)
 #
 if Result:
  Result.append("")
 return Result


def GetAddress(Properties, Full=True):
 Result = []
 # адрас з частак
 Addr = [ Properties[Key] for Key in [ 'addr:region', 'addr:district', 'addr:city', 'addr:street', 'addr:housenumber' ] if Key in Properties ]
 Addr = NormalizeAddress(Addr)
 if Addr:
  Result.append(Addr)
 # поўны адрас
 if Full:
  if 'addr:full' in Properties:
   Addr = Properties['addr:full'].split(",")
   Addr = NormalizeAddress(Addr)
   if Addr:
    Result.append(Addr)
 #
 return Result
